{
  "version": 7,
  "backups": [
    {
      "name": "Roblox Developers Rules",
      "messages": [
        {
          "data": {
            "content": "Welcome to Roblox Developers!\n\n*NOTE:* The text in **bold** is a summary of each rule.\nWe ask that you use common sense and review these rules further if requested or if you have any questions.",
            "embeds": [
              {
                "title": ":one: - Respect other members",
                "description": "This means:\n•  No hate speech.\n•  No racist comments.\n•  No sexist or transphobic comments.\n•  Avoid ableism or elitism.\n•  No discriminatory language.\n\n**The Roblox Developers Discord is meant for everyone, no one should ever feel unwelcome here - We want a friendly community.**",
                "color": 6974142
              },
              {
                "title": ":two: - No excessive swearing",
                "description": "Swearing is allowed, as long as it doesn’t break any other rules and is not done too often.\n\nWe do not ban the use of words. Instead, we use context to determine if a rule was broken.",
                "color": 6974142
              },
              {
                "title": ":three: - No advertising",
                "description": "Advertising here is defined as, the act of mentioning something in an attempt to get someone else to use or reserve it.\n\nExceptions\nYou may post an advertisement in these circumstances:\n• The channel topic allows it.\n• It is directly related to and in response to a conversation.\n• It does not directly or indirectly benefit you, would not be disruptive, and would be beneficial to a majority of members.\n\n**This includes advertising in members' direct messages using our server.**",
                "color": 6974142
              },
              {
                "title": ":four: - No spam, age-restricted or annoying content",
                "description": "Spam is defined as, posting the same or similar content repeatedly.\nAge-restricted is defined as, anything that would be considered culturally inappropriate or ban-worthy by Discord's standards.\nAnnoying is defined as, anything that would be disruptive to other members or would cause physical discomfort.\n\n**We have systems in place to avoid this, but they are imperfect.**\n\nExceptions\nThe  <#795488249031557141> channel is meant for content that may be considered inappropriate for younger members.\n• Characters with partial nudity, such as characters in swimsuits (not photos of real people).\n• Suggestive emojis, such as portraits of sexualized characters.\n• More excessive swearing.\n• Anything that Discord allows that is within a Mature ESRB rating.\n• Profile descriptions do not need to follow our rules.\n\n**Anything we consider too excessive, even if it is allowed by these exceptions, may be removed without warning.**",
                "color": 6974142
              },
              {
                "title": ":five: - Use channels for their intended purpose",
                "description": "Every channel has a relevant name and may have a topic with further information. Always read the topic before using a channel.\n\nDo not use a DM or mention a member (even staff) as an alternative to using a designated channel unless given permission by them.\n\n**If you have a question about a channel, ask a moderator or administrator.**",
                "color": 6974142
              },
              {
                "title": ":six: - Always listen to staff",
                "description": "Moderators may warn you if they believe you did something wrong. Always listen to them, even if what you did was not in the rules. Failure to listen to a moderator may result in further punishment.\n\n**If you believe what you did was not wrong, listen to them anyway, and open a ticket to discuss it in a civilized manner. Mistakes happen, everyone has room to grow.**",
                "color": 6974142
              },
              {
                "title": ":seven: - Follow Discord's ToS and Community guidelines",
                "description": "Always follow Discord's rules. If any of our rules contradict a Discord rule, Discord's rule must take priority.\n\nWe are in no way affiliated with or endorsed by Roblox. We can *not* and will *not* enforce the Roblox Terms of Service here. If you have a problem with their services or products you can contact them [**here**](https://roblox.com/support).\n\n[**Discord Terms of Service**](https://discord.com/terms)\n[**Discord Community Guidelines**](https://discord.com/guidelines)",
                "color": 6974142
              },
              {
                "title": "Community safety comes first",
                "description": "We will prioritize the safety of our members first. If you threaten our member's livelihood, financial state, or security, you will be removed from the server.\n\n**Always listen to moderators**\nThese rules are non-exhaustive and cannot account for every possible scenario. If a moderator asks you to stop doing something, listen to them.\n\n**Administrators are still moderators and must also be listened to.**\nRules are subject to change\nThe rules above may change at any time and without prior notice. You are responsible for ensuring you are always complying with them. Ignorance is not an excuse.\n\n**We may post an announcement when the rules have been updated.**\nFailure to comply may result in more severe punishments\nGenerally, we will warn you verbally to stop first. If you continue, you may be:\n\nGiven a more prominent warning that moderators can review in the future.\n• Muted so you are unable to talk in the server for an amount of time.\n• Roles may be taken away.\n• You may be kicked.\n• You may be banned.\n• Reported directly to authorities for further investigation in extreme circumstances or if required by Discord.\n\n**How to appeal a ban**\nWe provide a Discord server to appeal bans. If you have been banned, you can appeal at: https://discord.gg/k9jVfFD\n\nYou cannot appeal on someone else's behalf, this is a voluntary service and we will not guarantee any response times or actions.",
                "color": 14647637,
                "footer": {
                  "text": "Roblox Developers - Moderation Team"
                },
                "timestamp": "2023-05-02T04:54:00.000Z"
              }
            ],
            "attachments": []
          },
          "reference": ""
        }
      ],
      "targets": [
        {
          "url": ""
        }
      ]
    }
  ]
}
