{
  "version": 7,
  "backups": [
    {
      "content": null,
      "embeds": [
        {
          "description": "**Text in bold is summary** of each rule\nWe ask that you use common sense, this is not an exhaustive list of rules, if you believe it's not allowed then it probably isn't. Feel free to message a staff member if you have an questions.\n\n**__Rule 1:__ Follow Discord ToS (https://discord.com/terms/)**\nAlways follow Discord rules, Discord rules will always take priority.\nPlease do not joke about ToS violations such as age, we **WILL** take you seriously, and we **WILL** act.\n\n__We are not affiliated with Roblox, we *can not* and *will not* enforce Roblox ToS. If you would like to contact them go to https://roblox.com/support. __\n\n**__Rule 2:__ Always respect your fellow members**\nRoblox Developers is meant to be a safe and inclusive space for all people, no matter what.\nDo not be generally rude to people, or intentionally cause problems.\n\nIf you have a problem with another member, try to resolve it via a direct message (DM), or open a ticket at <#639890173869555761>. We may occasionally create a thread to discuss disagreements publicly.\n\n__This includes your username, profile picture, status, about me and banner.__\n\n**__Rule 3:__ No discriminatory behavior**\nDiscriminating against a user, spreading hate, etc is **NOT** tolerated here.\nThis includes:\n- No hate speech.\n- No racist comments.\n- No sexist or transphobic comments.\n- Avoid ableism or elitism.\n- No discriminatory language.\n\n__This includes your username, profile picture, status, about me and banner.__\n\n**__Rule 4:__ No age-restricted, annoying, or spammy content**\nAge-restricted content consists of content that is not suitable for a younger audience, such as NSFW content, overly suggestive content, gore, and more.\nAnnoying content is loud content that is meant to agitate people, content that cannot be stopped normally, bright or obnixious content.\nSpam is something that is content that is sent repetitively.\n\n__This includes your username, profile picture, status, about me and banner.__\n\n**__Rule 5:__ Do not show, or depict the use of any illicit substence**\nRoblox Developers' consists mainly of users under the age of 18. Children are impressionable, and do not need to see glorified drug usage. For this reason, you may not screenshare, camera share, or share images/gifs/videos of drug use and/or consumption.\n\n__This includes your username, profile picture, status, about me and banner.__\n\n**__Rule 6:__ Do not spam your mic, use loud soundboards and voice changers**\nThis is extremely annoying for members, and forbidden in voice channels.\nThis includes anything that would purposefully disrupt anyone's experience in voice channels.\n\nWe may server mute you, or in extreme cases ban you from using voice channels altogether.\n\n**__Rule 7:__ Do not advertise**\nAdvertising here is defined as, the act of mentioning something in an attempt to get someone else to use or reserve it.\n\n*Exceptions*\nYou may post an advertisement in these circumstances:\n- The channel topic allows it.\n- It is directly related to and in response to a conversation.\n- It does not directly or indirectly benefit you, would not be disruptive, and would be beneficial to a majority of members.\n\n__This includes advertising in members' direct messages using our server.__\n__This includes your username, profile picture, status, about me and banner.__\n\n**__Rule 8:__ English only**\nRoblox Developers is an English only server, please do not speak any other languages, or you may face punishment.\n\nRoblox Developers' staff cannot moderate in other languages, so the use of them is forbidden.",
          "color": 5117695,
          "author": {
            "name": "Roblox Developers' Rules",
            "icon_url": "https://images-ext-2.discordapp.net/external/R4zvVRs69kDLI6YTnGyFIkGYyVH3JpR_P1Dmt08MUVs/%3Fsize%3D4096/https/cdn.discordapp.com/icons/489424959270158356/a_d17a9260ea8ad5cf3005f01648478444.gif?width=140&height=140"
          }
        }
      ],
      "attachments": []
    }
  ]
}
